from datetime import datetime
import win32com.client
import json
import time

def print_excel_sheet(file_path, sheet_name):
    # Create an instance of Excel
    excel = win32com.client.Dispatch("Excel.Application")
    excel.Visible = False  # Set to True if you want to see Excel

    # Open the workbook
    print("Opening workbook...")
    # print(f"File path: {file_path}")
    workbook = excel.Workbooks.Open(file_path)
    
    try:
        print(f"Accessing sheet: {sheet_name}")
        sheet = workbook.Sheets(sheet_name)
        print("Preparing to print...")
        # time.sleep(5)  # Add delay if necessary
        sheet.PrintOut()  # Or try sheet.PrintOut(Copies=2)
        # sheet.PrintOut(PrintToFile=True, PrToFileName="output.pdf")
        print("Print command executed.")
        # time.sleep(5)  # Add delay if necessary\
    except Exception as e:
        print(f"An error occurred: {e}")

    finally:
        workbook.Close(SaveChanges=False)
        excel.Quit()

def find_last_row_with_data(sheet):
    # Loop through rows from the bottom up
    for row in range(sheet.max_row, 0, -1):
        # Check if any cell in the row has a value
        if any(cell.value for cell in sheet[row]):
            return row
    return None

def ask_for_sheet(wb):
    sheet = input("Enter sheet: ")

    if sheet not in wb.sheetnames:
        print(f"Sheet '{sheet}' not found in the workbook.")
        return None
    else:
        print("Sheet selected: ", sheet)
        return wb[sheet]

def iterate_id(id):
    # 'NW228' -> 'NW229'
    # SPS001 -> SPS002

    # Extract the prefix (letters) and the numeric part
    prefix = ''.join(filter(str.isalpha, id))  # All alphabetic characters
    number = ''.join(filter(str.isdigit, id))  # All numeric characters

    # Convert the numeric part to an integer and increment it
    new_number = int(number) + 1

    # Format the new ID, preserving the original number of digits in the numeric part
    return f"{prefix}{new_number:0{len(number)}d}"

def return_date_now():
    now = datetime.now()
    thai_year = now.year
    return datetime(thai_year, now.month, now.day, now.hour, now.minute, now.second)

def return_address(sales_id):
    # Read JSON from a file
    with open('config.json', 'r', encoding='utf-8') as file:
        data = json.load(file)  # Use json.load() to read from the file

    address_list = data['config']['address']

    address_prefix = ''.join(filter(str.isalpha, sales_id))

    for key, value in address_list.items():
        if address_prefix in key:
            return value
        
    # "address": {
    #         "NW": "บริษัทสุวรรณชาด จำกัด (00004/หัวหิน1) 5/15-16 ถนนเพชรเกษม ตำบลหัวหิน อำเภอหัวหิน จังหวัดประจวบคีรีขันธ์ รหัสไปรษณีย์ 77110 เลขประจำตัวผู้เสียภาษี 0105543116917",
    #         "SPS" : "บริษัทสุวรรณชาด จำกัด (00005/สะพานสูง) 99 ถนนรามคำแหง แขวงสะพานสูง เขตสะพานสูง จังหวัดกรุงเทพมหานคร รหัสไปรษณีย์10240 เลขประจำตัวผู้เสียภาษี 0105543116917",
    #         "PR9" : "บริษัทสุวรรณชาด จำกัด (00001/พระราม9) 185,187,189 ถนนประดิษฐ์มนูธรรม แขวงวังทองหลาง เขตวังทองหลาง กรุงเทพมหานคร รหัสไปรษณีย์10310  เลขประจำตัวผู้เสียภาษี 0105543116917",
    #         "SR1" : "บริษัทสุวรรณชาด จำกัด (00006/ศิริราช1) 264/18 ถนนพรานนก แขวงศิริราช เขตบางกอกน้อย กรุงเทพมหานคร รหัสไปรษณีย์10700  เลขประจำตัวผู้เสียภาษี 0105543116917",
    #         "SR2" : "บริษัทสุวรรณชาด จำกัด (00009/ศิริราช2) เลขที่2 อาคาร รพ.ศิริราช ปิยมหาราชการุณย์ ชั้นB1 ถนนพรานนก แขวงศิริราช เขตบางกอกน้อย กรุงเทพมหานคร รหัสไปรษณีย์10700  เลขประจำตัวผู้เสียภาษี 0105543116917",
    #         "GOV" : "บริษัทสุวรรณชาด จำกัด (00008/ศูนย์ราชการ)120 หมู่ 3  ถนนแจ้งวัฒนะ แขวงทุ่งสองห้อง เขตหลักสี่ กรุงเทพมหานคร รหัสไปรษณีย์10210  เลขประจำตัวผู้เสียภาษี 0105543116917",
    #         "KSS" : "บริษัทสุวรรณชาด จำกัด (00011/ม.เกษตร) อาคารส่วนสนับสนุนและอำนวยการค.สัตวแพทยศาสตร์ ชั้น 1 ม.เกษตรฯ เลขที่ 50 ถนนงามวงศ์วาน แขวงลาดยาว เขตจตุจักร กรุงเทพมหานคร รหัสไปรษณีย์10900  เลขประจำตัวผู้เสียภาษี 0105543116917",
    #         "CPT" : "บริษัทสุวรรณชาด จำกัด (00002/สีลม) 313 ถนนสีลม แขวงสีลม เขตบางรัก กรุงเทพมหานคร รหัสไปรษณีย์10500  เลขประจำตัวผู้เสียภาษี 0105543116917",
    #         "CRS" : "บริษัทสุวรรณชาด จำกัด (00016/เจริญสุข) ห้อง E-008E และ E011E เลขที่ 999/1 หมู่ 1 ถนน สุวรรณภูมิ 4 ตำบลหนองปรือ อำเภอบางพลี จังหวัดสมุทรปราการ 10540  เลขประจำตัวผู้เสียภาษี 0105543116917",
    #         "SKT" : "บริษัทสุวรรณชาด จำกัด (00015/สุโขทัย) 904 ถนนสุโขทัย แขวงดุสิต เขตดุสิต กรุงเทพมหานคร รหัสไปรษณีย์10300  เลขประจำตัวผู้เสียภาษี 0105543116917",
    #         "PRA" : "บริษัทสุวรรณชาด จำกัด (00017/พระบรมมหาราชวัง) พระบรมมหาราชวัง ถนนหน้าพระลาน แขวงพระบรมมหาราชวัง เขตพระนคร กรุงเทพมหานคร รหัสไปรษณีย์10200  เลขประจำตัวผู้เสียภาษี 0105543116917",
    #         "TCH" : "บริษัทสุวรรณชาด จำกัด (00022/ท่าช้าง) เลขที่ 196-198  ถนนมหาราช แขวงพระบรมมหาราชวัง เขตพระนคร จังหวัดกรุงเทพมหานคร รหัสไปรษณีย์10200  เลขประจำตัวผู้เสียภาษี 0105543116917",
    #         "TIG" : "บริษัทสุวรรณชาด จำกัด (00010/สนามเสือป่า) อาคาร 601 สำนักพระราชวัง (สนามเสือป่า) ถนนศรีอยุธยา แขวงดุสิต เขตดุสิต กรุงเทพฯ รหัสไปรษณีย์10300  เลขประจำตัวผู้เสียภาษี 0105543116917",
    #         "CCS" : "บริษัทสุวรรณชาด จำกัด (00023/ฉะเชิงเทรา) เลขที่ 122/2 ถนนมรุพงษ์ ตำบลหน้าเมือง อำเภอเมืองฉะเชิงเทรา จังหวัดฉะเชิงเทรา รหัสไปรษณีย์24000  เลขประจำตัวผู้เสียภาษี 0105543116917",
    #         "CCM" : "บริษัทสุวรรณชาด จำกัด (00021/ชวนชม) เลขที่ 33/1835 ถนนงามวงศ์วาน แขวงลาดยาว เขตจตุจักร กรุงเทพมหานคร รหัสไปรษณีย์10900  เลขประจำตัวผู้เสียภาษี 0105543116917",
    #         "WPD" : "บริษัทสุวรรณชาด จำกัด (00024/ราบ1) เลขที่ 181/7 ถนนวิภาวดีรังสิต แขวงสามเสนใน เขตพญาไท กรุงเทพมหานคร รหัสไปรษณีย์10400  เลขประจำตัวผู้เสียภาษี 0105543116917",
    #         "BKN" : "บริษัทสุวรรณชาด จำกัด (00025/ราบ11) เลขที่ 2/2099 ถนนพหลโยธิน แขวงอนุสาวรีย์ เขตบางเขน กรุงเทพมหานคร รหัสไปรษณีย์10220 เลขประจำตัวผู้เสียภาษี 0105543116917",
    #         "PBR" : "บริษัทสุวรรณชาด จำกัด (00026/เพชรบุรี) เลขที่ 10 ถนนราชวิถี ตำบลคลองกระแซง อำเภอเมืองเพชรบุรี จังหวัดเพชรบุรี รหัสไปรษณีย์76000 เลขประจำตัวผู้เสียภาษี 0105543116917",
    #         "NKS" : "บริษัทสุวรรณชาด จำกัด (00027/นครสวรรค์) อาคารสำนักงานทรัพย์สินพระมหากษัตริย์ เลขที่ 229/3 ถนนโกสีย์ ตำบลปากน้ำโพ อำเภอเมืองนคาสวรรค์ จังหวัดนคาสวรรค์ รหัสไปรษณีย์60000 เลขประจำตัวผู้เสียภาษี 0105543116917",
    #         "BF" : "บริษัทสุวรรณชาด จำกัด (00007/หัวหิน2) 99  หมู่บ้านบ่อฝ้าย ตำบลหัวหิน อำเภอหัวหิน จังหวัดประจวบฯ รหัสไปรษณีย์77110 เลขประจำตัวผู้เสียภาษี 0105543116917",
    #         "PEN" : "บริษัทสุวรรณชาด จำกัด (00013/เพนนินซูล่าพลาซ่า) 153  อาคารเดอะเพนนินซูลาพลาซ่า แบงค็อก ห้อง100 ชั้น1 ถนนราชดำริ แขวงลุมพินี เขตปทุมวัน กรุงเทพมหานคร รหัสไปรษณีย์10330  เลขประจำตัวผู้เสียภาษี 0105543116917",
    #         "CHM" : "บริษัทสุวรรณชาด จำกัด (00012/ชั่งหัวมัน) 1 หมู่ 5 ตำบลเขาปุก อำเภอท่าย่าง จังหวัดเพชรบุรี รหัสไปรษณีย์76130  เลขประจำตัวผู้เสียภาษี 0105543116917",
    #         "KPE" : "บริษัทสุวรรณชาด จำกัด (00000/สำนักงานใหญ่) เลขที่ 99 ชั้น2 ถนนรามคำแหง แขวงสะพานสูง เขตสะพานสูง จังหวัดกรุงเทพมหานคร รหัสไปรษณีย์10240  เลขประจำตัวผู้เสียภาษี 0105543116917"
    #    }